# Ход решения:
Обновить docker-scout

Задание first:
docker run --rm 'Имя контейнера с сайта ЦК'
Копируем ключ и отправляем

Задание args:
docker run --rm 'Имя контейнера с сайта ЦК' 'Строка с сайта ЦК'
Копируем ключ и отправляем

Задание env:
docker run --rm -e 'Строка с сайта ЦК' 'Имя контейнера с сайта ЦК'
Копируем ключ и отправляем

Задание port
docker run --rm -p 'Первый порт на сайте':'Второй порт на сайте' 'Имя контейнера с сайта ЦК'
Переходим на:
http://localhost:'Первый порт на сайте'
Копируем ключ и отправляем

Задание volume
cd 'Путь, где хотите создать директорию'
mkdir 'Имя директории'
docker run --rm -v 'Путь, где создали директорию''Имя для директории':'Путь с сайта' 'Имя контейнера с сайта ЦК'
Заходим в эту директорию
Копируем ключ и отправляем

Задание file:
docker run -it --name 'Любое имя' 'Имя контейнера с сайта ЦК'
docker cp 'То же самое любое имя':'Имя файла с расширением с сайта' "'Куда хотите файл поместить'"(!!!Именно в двойных кавычках)
Наверняка будет фото, так что переходим к нему, открываем и копируем ключ и отправляем(если не умеете, то ручками)

Задание run:
docker run --rm 'Имя контейнера с сайта ЦК'
docker ps
Копируем CONTAINER ID того контейнера, с которым работаете
docker exec 'CONTAINER ID' 'Команда с сайта'
Копируем ключ и отправляем

Задание lost:
docker history --no-trunc 'Имя контейнера с сайта ЦК'
Находим старую версию ключа, при необходимости расширяем командную строку, потому что эта команда полностью выводит данные об истории изменений
Копируем ключ и отправляем
